### Q7a)

In [1]:
# Imports
import pandas as pd
from matplotlib.pyplot import xcorr

/tmp/ipykernel_158480/3951374025.py:6: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  from pandas import datetime

In [2]:
daily_rainfall_data = pd.read_csv('../../datasets/daily_rainfall_brandywine.csv')
daily_rainfall_data

        year  month  day  Amount_mm
0     1961.0    1.0  1.0        1.0
1     1961.0    1.0  2.0       14.0
2     1961.0    1.0  3.0        8.6
3     1961.0    1.0  5.0        7.6
4     1961.0    1.0  6.0        2.2
...      ...    ...  ...        ...
7300     NaN    NaN  NaN        NaN
7301     NaN    NaN  NaN        NaN
7302     NaN    NaN  NaN        NaN
7303     NaN    NaN  NaN        NaN
7304     NaN    NaN  NaN        NaN

[7305 rows x 4 columns]

### Check for missing:
* any missing data
* any erroneous data (e.g. negative, or large values which are clearly incorrect)
* any samples which are too small or not matching in size if they are to be compared against other samples

In [3]:
# using isnull() function
daily_rainfall_data.isnull()

       year  month    day  Amount_mm
0     False  False  False      False
1     False  False  False      False
2     False  False  False      False
3     False  False  False      False
4     False  False  False      False
...     ...    ...    ...        ...
7300   True   True   True       True
7301   True   True   True       True
7302   True   True   True       True
7303   True   True   True       True
7304   True   True   True       True

[7305 rows x 4 columns]

In [4]:
# Any missing values?
daily_rainfall_data.isnull().values.any()

True

In [5]:
print(daily_rainfall_data.isnull().values.sum())

1336

There are missing values.

#### Remove missing values

In [44]:
daily_rainfall_data = daily_rainfall_data.dropna(how='all')
print(daily_rainfall_data.isnull().values.sum())

0

In [7]:
daily_rainfall_data = daily_rainfall_data.astype({"year":"int", "month":"int", "day":"int"})
daily_rainfall_data

      year  month  day  Amount_mm
0     1961      1    1        1.0
1     1961      1    2       14.0
2     1961      1    3        8.6
3     1961      1    5        7.6
4     1961      1    6        2.2
...    ...    ...  ...        ...
6966  2015     12   22        2.7
6967  2015     12   25       24.1
6968  2015     12   26       10.4
6969  2015     12   30        2.8
6970  2015     12   31        1.1

[6971 rows x 4 columns]

### Original data copy

In [8]:
daily_rainfall_data_copy = daily_rainfall_data.copy()

### Transform the data to time series format

In [9]:
daily_rainfall_data_copy['dateInt'] = daily_rainfall_data_copy['year'].astype(str) + daily_rainfall_data_copy['month'].astype(str).str.zfill(2)+ daily_rainfall_data_copy['day'].astype(str).str.zfill(2)
daily_rainfall_data_copy['Date'] = pd.to_datetime(daily_rainfall_data_copy['dateInt'], format='%Y%m%d')
daily_rainfall_data_copy

      year  month  day  Amount_mm   dateInt       Date
0     1961      1    1        1.0  19610101 1961-01-01
1     1961      1    2       14.0  19610102 1961-01-02
2     1961      1    3        8.6  19610103 1961-01-03
3     1961      1    5        7.6  19610105 1961-01-05
4     1961      1    6        2.2  19610106 1961-01-06
...    ...    ...  ...        ...       ...        ...
6966  2015     12   22        2.7  20151222 2015-12-22
6967  2015     12   25       24.1  20151225 2015-12-25
6968  2015     12   26       10.4  20151226 2015-12-26
6969  2015     12   30        2.8  20151230 2015-12-30
6970  2015     12   31        1.1  20151231 2015-12-31

[6971 rows x 6 columns]

### Daily Annual Series

In [10]:
# daily_rainfall_data_copy = daily_rainfall_data_copy.rename(columns={'Date': 'daily'})
daily_rainfall_data_series =  daily_rainfall_data_copy.filter(['Date', 'Amount_mm'], axis=1)
daily_rainfall_data_series.set_index('Date').resample('D').sum()
daily_rainfall_data_series

           Date  Amount_mm
0    1961-01-01        1.0
1    1961-01-02       14.0
2    1961-01-03        8.6
3    1961-01-05        7.6
4    1961-01-06        2.2
...         ...        ...
6966 2015-12-22        2.7
6967 2015-12-25       24.1
6968 2015-12-26       10.4
6969 2015-12-30        2.8
6970 2015-12-31        1.1

[6971 rows x 2 columns]

### Monthly Annual Series

In [11]:
monthly_rainfall_data_series =  daily_rainfall_data_copy.filter(['Date', 'Amount_mm'], axis=1)
monthly_rainfall_data_series = monthly_rainfall_data_series.set_index('Date').resample('M').sum()
monthly_rainfall_data_series

            Amount_mm
Date
1961-01-31       79.2
1961-02-28       27.7
1961-03-31       13.9
1961-04-30       55.2
1961-05-31       38.2
...               ...
2015-08-31       71.4
2015-09-30       25.8
2015-10-31       58.4
2015-11-30      110.7
2015-12-31      106.6

[660 rows x 1 columns]

### Annual Time Series

In [12]:
annual_rainfall_data_series =  daily_rainfall_data_copy.filter(['Date', 'Amount_mm'], axis=1)
annual_rainfall_data_series = annual_rainfall_data_series.set_index('Date').resample('Y').sum()
annual_rainfall_data_series

            Amount_mm
Date
1961-12-31      615.2
1962-12-31      518.8
1963-12-31      710.8
1964-12-31      458.0
1965-12-31      803.1
1966-12-31      764.7
1967-12-31      653.5
1968-12-31      727.2
1969-12-31      762.5
1970-12-31      579.9
1971-12-31      562.9
1972-12-31      506.6
1973-12-31      497.9
1974-12-31      600.8
1975-12-31      546.7
1976-12-31      669.8
1977-12-31      608.8
1978-12-31      764.3
1979-12-31      727.4
1980-12-31      755.6
1981-12-31      673.3
1982-12-31      536.8
1983-12-31      619.1
1984-12-31      638.7
1985-12-31      640.8
1986-12-31      658.6
1987-12-31      742.6
1988-12-31      633.3
1989-12-31      371.5
1990-12-31      521.1
1991-12-31      514.5
1992-12-31      631.8
1993-12-31      671.7
1994-12-31      537.6
1995-12-31      609.5
1996-12-31      521.1
1997-12-31      591.7
1998-12-31      804.2
1999-12-31      634.1
2000-12-31      864.2
2001-12-31      672.2
2002-12-31      671.7
2003-12-31      493.6
2004-12-31      730.9
2005-12-31      726.7
2006-12-31      544.2
2007-12-31      582.6
2008-12-31      831.5
2009-12-31      667.4
2010-12-31      764.4
2011-12-31      552.6
2012-12-31     1007.4
2013-12-31      641.0
2014-12-31      638.9
2015-12-31      680.8

### Correlation for specific daily, monthly and yearly series.

daily correlation for 5 lags

In [37]:
#daily_rainfall_data_series = daily_rainfall_data_series.squeeze(axis=0)
daily_rainfall_data_series['Amount_mm'].squeeze().autocorr(lag=5)

0.022291581239872883

monthly correlatioon between 2 lags

In [34]:
#monthly_rainfall_data_series = monthly_rainfall_data_series.squeeze(axis=0)
monthly_rainfall_data_series['Amount_mm'].squeeze().autocorr()

0.04378834871914531

annual correlatioon between 7 lags

In [38]:
#monthly_rainfall_data_series = monthly_rainfall_data_series.squeeze(axis=0)
annual_rainfall_data_series['Amount_mm'].squeeze().autocorr(lag=7)

0.018757197187676256